{
    "slug":  "john-psalms-30",
    "name":  "John + Psalms in 30 Days",
    "days":  [
                 {
                     "dayIndex":  1,
                     "johnRef":  "John 1:1-18",
                     "psalmRef":  "Psalm 1",
                     "theme":  "Beginning with the Word",
                     "recaps":  {
                                    "classic_pastor":  "In John 1:1-18 and Psalm 1, the Lord calls you into Beginning with the Word. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 1:1-18 plus Psalm 1, and the vibe is Beginning with the Word. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 1:1-18 to Psalm 1, the melody of Beginning with the Word lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 1:1-18 and Psalm 1. The focus is Beginning with the Word. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 1:1-18 alongside Psalm 1 highlights Beginning with the Word as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  2,
                     "johnRef":  "John 1:19-34",
                     "psalmRef":  "Psalm 2",
                     "theme":  "Witness and trust",
                     "recaps":  {
                                    "classic_pastor":  "In John 1:19-34 and Psalm 2, the Lord calls you into Witness and trust. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 1:19-34 plus Psalm 2, and the vibe is Witness and trust. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 1:19-34 to Psalm 2, the melody of Witness and trust lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 1:19-34 and Psalm 2. The focus is Witness and trust. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 1:19-34 alongside Psalm 2 highlights Witness and trust as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  3,
                     "johnRef":  "John 1:35-51",
                     "psalmRef":  "Psalm 3",
                     "theme":  "Come and see",
                     "recaps":  {
                                    "classic_pastor":  "In John 1:35-51 and Psalm 3, the Lord calls you into Come and see. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 1:35-51 plus Psalm 3, and the vibe is Come and see. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 1:35-51 to Psalm 3, the melody of Come and see lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 1:35-51 and Psalm 3. The focus is Come and see. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 1:35-51 alongside Psalm 3 highlights Come and see as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  4,
                     "johnRef":  "John 2:1-25",
                     "psalmRef":  "Psalm 4",
                     "theme":  "New joy and clean hearts",
                     "recaps":  {
                                    "classic_pastor":  "In John 2:1-25 and Psalm 4, the Lord calls you into New joy and clean hearts. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 2:1-25 plus Psalm 4, and the vibe is New joy and clean hearts. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 2:1-25 to Psalm 4, the melody of New joy and clean hearts lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 2:1-25 and Psalm 4. The focus is New joy and clean hearts. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 2:1-25 alongside Psalm 4 highlights New joy and clean hearts as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  5,
                     "johnRef":  "John 3:1-21",
                     "psalmRef":  "Psalm 5",
                     "theme":  "Born from above",
                     "recaps":  {
                                    "classic_pastor":  "In John 3:1-21 and Psalm 5, the Lord calls you into Born from above. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 3:1-21 plus Psalm 5, and the vibe is Born from above. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 3:1-21 to Psalm 5, the melody of Born from above lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 3:1-21 and Psalm 5. The focus is Born from above. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 3:1-21 alongside Psalm 5 highlights Born from above as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  6,
                     "johnRef":  "John 3:22-36",
                     "psalmRef":  "Psalm 6",
                     "theme":  "Less of me, more of Christ",
                     "recaps":  {
                                    "classic_pastor":  "In John 3:22-36 and Psalm 6, the Lord calls you into Less of me, more of Christ. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 3:22-36 plus Psalm 6, and the vibe is Less of me, more of Christ. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 3:22-36 to Psalm 6, the melody of Less of me, more of Christ lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 3:22-36 and Psalm 6. The focus is Less of me, more of Christ. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 3:22-36 alongside Psalm 6 highlights Less of me, more of Christ as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  7,
                     "johnRef":  "John 4:1-26",
                     "psalmRef":  "Psalm 7",
                     "theme":  "Living water",
                     "recaps":  {
                                    "classic_pastor":  "In John 4:1-26 and Psalm 7, the Lord calls you into Living water. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 4:1-26 plus Psalm 7, and the vibe is Living water. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 4:1-26 to Psalm 7, the melody of Living water lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 4:1-26 and Psalm 7. The focus is Living water. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 4:1-26 alongside Psalm 7 highlights Living water as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  8,
                     "johnRef":  "John 4:27-54",
                     "psalmRef":  "Psalm 8",
                     "theme":  "Faith for the whole house",
                     "recaps":  {
                                    "classic_pastor":  "In John 4:27-54 and Psalm 8, the Lord calls you into Faith for the whole house. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 4:27-54 plus Psalm 8, and the vibe is Faith for the whole house. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 4:27-54 to Psalm 8, the melody of Faith for the whole house lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 4:27-54 and Psalm 8. The focus is Faith for the whole house. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 4:27-54 alongside Psalm 8 highlights Faith for the whole house as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  9,
                     "johnRef":  "John 5:1-24",
                     "psalmRef":  "Psalm 9",
                     "theme":  "Mercy on ordinary days",
                     "recaps":  {
                                    "classic_pastor":  "In John 5:1-24 and Psalm 9, the Lord calls you into Mercy on ordinary days. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 5:1-24 plus Psalm 9, and the vibe is Mercy on ordinary days. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 5:1-24 to Psalm 9, the melody of Mercy on ordinary days lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 5:1-24 and Psalm 9. The focus is Mercy on ordinary days. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 5:1-24 alongside Psalm 9 highlights Mercy on ordinary days as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  10,
                     "johnRef":  "John 5:25-47",
                     "psalmRef":  "Psalm 10",
                     "theme":  "Hearing and believing",
                     "recaps":  {
                                    "classic_pastor":  "In John 5:25-47 and Psalm 10, the Lord calls you into Hearing and believing. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 5:25-47 plus Psalm 10, and the vibe is Hearing and believing. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 5:25-47 to Psalm 10, the melody of Hearing and believing lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 5:25-47 and Psalm 10. The focus is Hearing and believing. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 5:25-47 alongside Psalm 10 highlights Hearing and believing as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  11,
                     "johnRef":  "John 6:1-21",
                     "psalmRef":  "Psalm 11",
                     "theme":  "Bread for the weary",
                     "recaps":  {
                                    "classic_pastor":  "In John 6:1-21 and Psalm 11, the Lord calls you into Bread for the weary. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 6:1-21 plus Psalm 11, and the vibe is Bread for the weary. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 6:1-21 to Psalm 11, the melody of Bread for the weary lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 6:1-21 and Psalm 11. The focus is Bread for the weary. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 6:1-21 alongside Psalm 11 highlights Bread for the weary as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  12,
                     "johnRef":  "John 6:22-40",
                     "psalmRef":  "Psalm 12",
                     "theme":  "Coming to Jesus",
                     "recaps":  {
                                    "classic_pastor":  "In John 6:22-40 and Psalm 12, the Lord calls you into Coming to Jesus. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 6:22-40 plus Psalm 12, and the vibe is Coming to Jesus. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 6:22-40 to Psalm 12, the melody of Coming to Jesus lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 6:22-40 and Psalm 12. The focus is Coming to Jesus. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 6:22-40 alongside Psalm 12 highlights Coming to Jesus as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  13,
                     "johnRef":  "John 6:41-71",
                     "psalmRef":  "Psalm 13",
                     "theme":  "Words of eternal life",
                     "recaps":  {
                                    "classic_pastor":  "In John 6:41-71 and Psalm 13, the Lord calls you into Words of eternal life. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 6:41-71 plus Psalm 13, and the vibe is Words of eternal life. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 6:41-71 to Psalm 13, the melody of Words of eternal life lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 6:41-71 and Psalm 13. The focus is Words of eternal life. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 6:41-71 alongside Psalm 13 highlights Words of eternal life as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  14,
                     "johnRef":  "John 7:1-24",
                     "psalmRef":  "Psalm 14",
                     "theme":  "Courage under pressure",
                     "recaps":  {
                                    "classic_pastor":  "In John 7:1-24 and Psalm 14, the Lord calls you into Courage under pressure. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 7:1-24 plus Psalm 14, and the vibe is Courage under pressure. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 7:1-24 to Psalm 14, the melody of Courage under pressure lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 7:1-24 and Psalm 14. The focus is Courage under pressure. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 7:1-24 alongside Psalm 14 highlights Courage under pressure as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  15,
                     "johnRef":  "John 7:25-52",
                     "psalmRef":  "Psalm 15",
                     "theme":  "Truth in the open",
                     "recaps":  {
                                    "classic_pastor":  "In John 7:25-52 and Psalm 15, the Lord calls you into Truth in the open. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 7:25-52 plus Psalm 15, and the vibe is Truth in the open. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 7:25-52 to Psalm 15, the melody of Truth in the open lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 7:25-52 and Psalm 15. The focus is Truth in the open. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 7:25-52 alongside Psalm 15 highlights Truth in the open as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  16,
                     "johnRef":  "John 8:1-20",
                     "psalmRef":  "Psalm 16",
                     "theme":  "No condemnation",
                     "recaps":  {
                                    "classic_pastor":  "In John 8:1-20 and Psalm 16, the Lord calls you into No condemnation. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 8:1-20 plus Psalm 16, and the vibe is No condemnation. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 8:1-20 to Psalm 16, the melody of No condemnation lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 8:1-20 and Psalm 16. The focus is No condemnation. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 8:1-20 alongside Psalm 16 highlights No condemnation as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  17,
                     "johnRef":  "John 8:21-47",
                     "psalmRef":  "Psalm 17",
                     "theme":  "Freedom in truth",
                     "recaps":  {
                                    "classic_pastor":  "In John 8:21-47 and Psalm 17, the Lord calls you into Freedom in truth. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 8:21-47 plus Psalm 17, and the vibe is Freedom in truth. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 8:21-47 to Psalm 17, the melody of Freedom in truth lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 8:21-47 and Psalm 17. The focus is Freedom in truth. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 8:21-47 alongside Psalm 17 highlights Freedom in truth as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  18,
                     "johnRef":  "John 8:48-59",
                     "psalmRef":  "Psalm 18:1-24",
                     "theme":  "I AM with you",
                     "recaps":  {
                                    "classic_pastor":  "In John 8:48-59 and Psalm 18:1-24, the Lord calls you into I AM with you. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 8:48-59 plus Psalm 18:1-24, and the vibe is I AM with you. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 8:48-59 to Psalm 18:1-24, the melody of I AM with you lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 8:48-59 and Psalm 18:1-24. The focus is I AM with you. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 8:48-59 alongside Psalm 18:1-24 highlights I AM with you as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  19,
                     "johnRef":  "John 9:1-23",
                     "psalmRef":  "Psalm 18:25-50",
                     "theme":  "Sight for blind places",
                     "recaps":  {
                                    "classic_pastor":  "In John 9:1-23 and Psalm 18:25-50, the Lord calls you into Sight for blind places. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 9:1-23 plus Psalm 18:25-50, and the vibe is Sight for blind places. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 9:1-23 to Psalm 18:25-50, the melody of Sight for blind places lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 9:1-23 and Psalm 18:25-50. The focus is Sight for blind places. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 9:1-23 alongside Psalm 18:25-50 highlights Sight for blind places as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  20,
                     "johnRef":  "John 9:24-41",
                     "psalmRef":  "Psalm 19",
                     "theme":  "Light and honest worship",
                     "recaps":  {
                                    "classic_pastor":  "In John 9:24-41 and Psalm 19, the Lord calls you into Light and honest worship. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 9:24-41 plus Psalm 19, and the vibe is Light and honest worship. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 9:24-41 to Psalm 19, the melody of Light and honest worship lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 9:24-41 and Psalm 19. The focus is Light and honest worship. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 9:24-41 alongside Psalm 19 highlights Light and honest worship as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  21,
                     "johnRef":  "John 10:1-21",
                     "psalmRef":  "Psalm 20",
                     "theme":  "Known by name",
                     "recaps":  {
                                    "classic_pastor":  "In John 10:1-21 and Psalm 20, the Lord calls you into Known by name. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 10:1-21 plus Psalm 20, and the vibe is Known by name. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 10:1-21 to Psalm 20, the melody of Known by name lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 10:1-21 and Psalm 20. The focus is Known by name. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 10:1-21 alongside Psalm 20 highlights Known by name as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  22,
                     "johnRef":  "John 10:22-42",
                     "psalmRef":  "Psalm 21",
                     "theme":  "Secure in his hand",
                     "recaps":  {
                                    "classic_pastor":  "In John 10:22-42 and Psalm 21, the Lord calls you into Secure in his hand. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 10:22-42 plus Psalm 21, and the vibe is Secure in his hand. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 10:22-42 to Psalm 21, the melody of Secure in his hand lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 10:22-42 and Psalm 21. The focus is Secure in his hand. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 10:22-42 alongside Psalm 21 highlights Secure in his hand as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  23,
                     "johnRef":  "John 11:1-27",
                     "psalmRef":  "Psalm 22:1-18",
                     "theme":  "Hope in grief",
                     "recaps":  {
                                    "classic_pastor":  "In John 11:1-27 and Psalm 22:1-18, the Lord calls you into Hope in grief. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 11:1-27 plus Psalm 22:1-18, and the vibe is Hope in grief. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 11:1-27 to Psalm 22:1-18, the melody of Hope in grief lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 11:1-27 and Psalm 22:1-18. The focus is Hope in grief. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 11:1-27 alongside Psalm 22:1-18 highlights Hope in grief as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  24,
                     "johnRef":  "John 11:28-57",
                     "psalmRef":  "Psalm 22:19-31",
                     "theme":  "Resurrection life",
                     "recaps":  {
                                    "classic_pastor":  "In John 11:28-57 and Psalm 22:19-31, the Lord calls you into Resurrection life. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 11:28-57 plus Psalm 22:19-31, and the vibe is Resurrection life. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 11:28-57 to Psalm 22:19-31, the melody of Resurrection life lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 11:28-57 and Psalm 22:19-31. The focus is Resurrection life. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 11:28-57 alongside Psalm 22:19-31 highlights Resurrection life as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  25,
                     "johnRef":  "John 12:1-26",
                     "psalmRef":  "Psalm 23",
                     "theme":  "Costly devotion",
                     "recaps":  {
                                    "classic_pastor":  "In John 12:1-26 and Psalm 23, the Lord calls you into Costly devotion. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 12:1-26 plus Psalm 23, and the vibe is Costly devotion. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 12:1-26 to Psalm 23, the melody of Costly devotion lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 12:1-26 and Psalm 23. The focus is Costly devotion. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 12:1-26 alongside Psalm 23 highlights Costly devotion as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  26,
                     "johnRef":  "John 12:27-50",
                     "psalmRef":  "Psalm 24",
                     "theme":  "Lift up your heart",
                     "recaps":  {
                                    "classic_pastor":  "In John 12:27-50 and Psalm 24, the Lord calls you into Lift up your heart. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 12:27-50 plus Psalm 24, and the vibe is Lift up your heart. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 12:27-50 to Psalm 24, the melody of Lift up your heart lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 12:27-50 and Psalm 24. The focus is Lift up your heart. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 12:27-50 alongside Psalm 24 highlights Lift up your heart as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  27,
                     "johnRef":  "John 13:1-20",
                     "psalmRef":  "Psalm 25",
                     "theme":  "Love that kneels",
                     "recaps":  {
                                    "classic_pastor":  "In John 13:1-20 and Psalm 25, the Lord calls you into Love that kneels. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 13:1-20 plus Psalm 25, and the vibe is Love that kneels. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 13:1-20 to Psalm 25, the melody of Love that kneels lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 13:1-20 and Psalm 25. The focus is Love that kneels. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 13:1-20 alongside Psalm 25 highlights Love that kneels as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  28,
                     "johnRef":  "John 13:21-38",
                     "psalmRef":  "Psalm 26",
                     "theme":  "Steady through failure",
                     "recaps":  {
                                    "classic_pastor":  "In John 13:21-38 and Psalm 26, the Lord calls you into Steady through failure. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 13:21-38 plus Psalm 26, and the vibe is Steady through failure. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 13:21-38 to Psalm 26, the melody of Steady through failure lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 13:21-38 and Psalm 26. The focus is Steady through failure. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 13:21-38 alongside Psalm 26 highlights Steady through failure as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  29,
                     "johnRef":  "John 14:1-17",
                     "psalmRef":  "Psalm 27",
                     "theme":  "Peace for anxious hearts",
                     "recaps":  {
                                    "classic_pastor":  "In John 14:1-17 and Psalm 27, the Lord calls you into Peace for anxious hearts. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 14:1-17 plus Psalm 27, and the vibe is Peace for anxious hearts. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 14:1-17 to Psalm 27, the melody of Peace for anxious hearts lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 14:1-17 and Psalm 27. The focus is Peace for anxious hearts. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 14:1-17 alongside Psalm 27 highlights Peace for anxious hearts as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 },
                 {
                     "dayIndex":  30,
                     "johnRef":  "John 14:18-31",
                     "psalmRef":  "Psalm 28",
                     "theme":  "Kept by the Helper",
                     "recaps":  {
                                    "classic_pastor":  "In John 14:18-31 and Psalm 28, the Lord calls you into Kept by the Helper. Receive this word with humility, and let it shape your next faithful step.",
                                    "gen_z":  "Today is John 14:18-31 plus Psalm 28, and the vibe is Kept by the Helper. Keep it real with God and move different because His word just met you here.",
                                    "poetic":  "From John 14:18-31 to Psalm 28, the melody of Kept by the Helper lingers in your spirit. Walk softly today, carrying this light into every ordinary moment.",
                                    "coach":  "Today\u0027s reps were John 14:18-31 and Psalm 28. The focus is Kept by the Helper. Keep it simple: choose one clear action and follow through before the day ends.",
                                    "scholar":  "Reading John 14:18-31 alongside Psalm 28 highlights Kept by the Helper as both doctrine and discipleship. Integrate the truth by connecting interpretation with lived obedience."
                                }
                 }
             ]
}
